GCSE/Computing_Fundamentals/pages/3-1-12-Testing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>3.1.12 Testing</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">3.1.12 Testing</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Application Testing</a>
<ul>
<li><a href="#sec-1-1">Learn It</a></li>
<li><a href="#sec-1-2">Research It</a></li>
<li><a href="#sec-1-3">Learn It</a></li>
<li><a href="#sec-1-4">Learn It</a></li>
<li><a href="#sec-1-5">Try It</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class=ribbon>
<a href="GITHUB URL HERE">Fork me on GitHub</a>
</div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Application Testing</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Software testing is a vital part of the Software Development Cycle.
</li>
<li>We all make mistakes, and even the best programmers and designers aren't infalliable.
</li>
<li>Software Testing is important because: 
<ol class="org-ol">
<li>it highlights the defects and errors that were made during the development phases.
</li>
<li>it ensures a Customer can rely on the product and that they are satisfied with it.
</li>
<li>it is very important to ensure the Quality of the product.
</li>
<li>it ensures effective performance of software application or product.
</li>
<li>it saves time and money, in the future, correcting errors and bug.
</li>
</ol>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 research">
<h3 id="sec-1-2">Research It</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Have a look at this<a href="https://en.wikipedia.org/wiki/Software_testing#Testing_Types"> wikipedia article</a> on types of testing. 
</li>
<li>For each type of test, write a single sentence to describe the basic approach.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 learn">
<h3 id="sec-1-3">Learn It</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Most testing can be broken up into one of two types.
<ol class="org-ol">
<li>Unit testing
</li>
<li>Modular testing
</li>
</ol>
</li>
<li><b>Unit testing</b>
<ul class="org-ul">
<li>In Unit testing, individual blocks of code are tested.
</li>
<li>These might be individual functions or classes.
</li>
<li>This type of testing is often carried out during development.
</li>
<li>The programmer would keep detailed documentation on the tests that have been carried out.
</li>
<li>Unit testing is an excellent way of ensuring small bugs and faults in the code are picked up early. It does not test integration with other parts of the program very well though.
</li>
</ul>
</li>
<li><b>Modular Testing</b>
<ul class="org-ul">
<li>Modular testing, would test some aspect of the finished software.
</li>
<li>This might be a test on the GUI, or integration with a database.
</li>
<li>These tests are normally carried out by specialist testers.
</li>
<li>The tester would keep detailed documentaion on the tests to feedback to developers.
</li>
<li>Modular testing gives reassurance that the whole application works as intended. It is however, a fairly lengthy and complicated process.
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 learn">
<h3 id="sec-1-4">Learn It</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>We can perform some tests without the use of a computer or any of the real code.
</li>
<li>Often, when we write an algorithm, we'll want to test that it works correctly.
</li>
<li>We can use trace tables to achieve this.
</li>
</ul>
<pre class="example">
X &lt;-- 1
Y &lt;-- 2
WHILE X &lt; 20
    OUTPUT X
    X &lt;-- X + Y
    Y &lt;-- Y + 1
ENDWHILE
</pre>
<ul class="org-ul">
<li>The variable in the above pseudocode algorithm can traced using a trace table.
</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">OUTPUT</th>
<th scope="col" class="right">X</th>
<th scope="col" class="right">Y</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">&#xa0;</td>
<td class="right">1</td>
<td class="right">2</td>
</tr>

<tr>
<td class="right">1</td>
<td class="right">3</td>
<td class="right">3</td>
</tr>

<tr>
<td class="right">3</td>
<td class="right">6</td>
<td class="right">4</td>
</tr>

<tr>
<td class="right">6</td>
<td class="right">10</td>
<td class="right">5</td>
</tr>

<tr>
<td class="right">10</td>
<td class="right">15</td>
<td class="right">6</td>
</tr>

<tr>
<td class="right">15</td>
<td class="right">21</td>
<td class="right">7</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>The trace table allows us to understand what is happening to the values of variables within the algorithm.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3 try">
<h3 id="sec-1-5">Try It</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Try drawing trace tables for the following algorithms.
</li>
</ul>
<pre class="example">
Y &lt;-- 3
FOR X &lt;-- 1 TO 5
    Y &lt;-- Y + X
ENDFOR
OUTPUT Y
</pre>
<pre class="example">
List &lt;-- [10,8,3,5,6,1,2]
Total &lt;-- 0
FOR i &lt;-- 1 TO LEN(List)
    TOTAL &lt;-- TOTAL + List[i]
ENDFOR
OUTPUT TOTAL
</pre>
<pre class="example">
num &lt;-- 78
answer &lt;-- ''
WHILE num &gt; 0
    r &lt;-- num MOD 2
    num &lt;-- num / 2
    answer &lt;-- STR(r) + answer 
ENDWHILE
OUTPUT answer
</pre>
<pre class="example">
nums = [6,2,8,1,9,2]
n = 0
FOR i &lt;-- 1 TO LEN(nums)
    IF nums[i] &gt; n
        n = nums[i]
    ENDIF
ENDFOR
OUTPUT n
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
